; domain
(define (domain spanner)                    
(:requirements :typing :strips)                
(:types 
	location locatable - object
	man nut spanner - locatable	
)                                           
                                                                               
(:predicates 
	(at ?m - locatable ?l - location)
	(carrying ?m - man ?s - spanner)
	(useable ?s - spanner)
	(link ?l1 - location ?l2 - location)
	(tightened ?n - nut)
	(loose ?n - nut))                                                                                           
(:action walk 
        :parameters (?start - location ?end - location ?m - man)
        :precondition (and (at ?m ?start) 
                           (link ?start ?end))                                                          
        :effect (and (not (at ?m ?start)) (at ?m ?end)))

(:action pickup_spanner 
        :parameters (?l - location ?s - spanner ?m - man)
        :precondition (and (at ?m ?l) 
                           (at ?s ?l))
        :effect (and (not (at ?s ?l))
                     (carrying ?m ?s)))

(:action tighten_nut 
        :parameters (?l - location ?s - spanner ?m - man ?n - nut)
        :precondition (and (at ?m ?l) 
		      	   (at ?n ?l)
			   (carrying ?m ?s)
			   (useable ?s)
			   (loose ?n))
        :effect (and (not (loose ?n))(not (useable ?s)) (tightened ?n)))
)

; problem
(define (problem p-s6-n6-l4-seed2)
 (:domain spanner)
 (:objects 
     bob - man
     spanner1 spanner2 spanner3 spanner4 spanner5 spanner6 - spanner
     nut1 nut2 nut3 nut4 nut5 nut6 - nut
     location1 location2 location3 location4 - location
     shed gate - location
    )
 (:init 
    (at bob shed)
    (at spanner1 location1)
    (useable spanner1)
    (at spanner2 location1)
    (useable spanner2)
    (at spanner3 location1)
    (useable spanner3)
    (at spanner4 location3)
    (useable spanner4)
    (at spanner5 location2)
    (useable spanner5)
    (at spanner6 location3)
    (useable spanner6)
    (loose nut1)
    (at nut1 gate)
    (loose nut2)
    (at nut2 gate)
    (loose nut3)
    (at nut3 gate)
    (loose nut4)
    (at nut4 gate)
    (loose nut5)
    (at nut5 gate)
    (loose nut6)
    (at nut6 gate)
    (link shed location1)
    (link location4 gate)
    (link location1 location2)
    (link location2 location3)
    (link location3 location4)
)
 (:goal
  (and
   (tightened nut1)
   (tightened nut2)
   (tightened nut3)
   (tightened nut4)
   (tightened nut5)
   (tightened nut6)
)))

; plan
1. (walk shed location1 bob)
   deleted: (at bob shed)
   added: (at bob location1)
   goals met: 0 of 6
2. (pickup_spanner location1 spanner3 bob)
   deleted: (at spanner3 location1)
   added: (carrying bob spanner3)
   goals met: 0 of 6
3. (pickup_spanner location1 spanner2 bob)
   deleted: (at spanner2 location1)
   added: (carrying bob spanner2)
   goals met: 0 of 6
4. (pickup_spanner location1 spanner1 bob)
   deleted: (at spanner1 location1)
   added: (carrying bob spanner1)
   goals met: 0 of 6
5. (walk location1 location2 bob)
   deleted: (at bob location1)
   added: (at bob location2)
   goals met: 0 of 6
6. (pickup_spanner location2 spanner5 bob)
   deleted: (at spanner5 location2)
   added: (carrying bob spanner5)
   goals met: 0 of 6
7. (walk location2 location3 bob)
   deleted: (at bob location2)
   added: (at bob location3)
   goals met: 0 of 6
8. (pickup_spanner location3 spanner6 bob)
   deleted: (at spanner6 location3)
   added: (carrying bob spanner6)
   goals met: 0 of 6
9. (pickup_spanner location3 spanner4 bob)
   deleted: (at spanner4 location3)
   added: (carrying bob spanner4)
   goals met: 0 of 6
10. (walk location3 location4 bob)
   deleted: (at bob location3)
   added: (at bob location4)
   goals met: 0 of 6
11. (walk location4 gate bob)
   deleted: (at bob location4)
   added: (at bob gate)
   goals met: 0 of 6
12. (tighten_nut gate spanner6 bob nut1)
   deleted: (loose nut1) (useable spanner6)
   added: (tightened nut1)
   goals met: 1 of 6
13. (tighten_nut gate spanner5 bob nut2)
   deleted: (loose nut2) (useable spanner5)
   added: (tightened nut2)
   goals met: 2 of 6
14. (tighten_nut gate spanner4 bob nut3)
   deleted: (loose nut3) (useable spanner4)
   added: (tightened nut3)
   goals met: 3 of 6
15. (tighten_nut gate spanner3 bob nut4)
   deleted: (loose nut4) (useable spanner3)
   added: (tightened nut4)
   goals met: 4 of 6
16. (tighten_nut gate spanner2 bob nut5)
   deleted: (loose nut5) (useable spanner2)
   added: (tightened nut5)
   goals met: 5 of 6
17. (tighten_nut gate spanner1 bob nut6)
   deleted: (loose nut6) (useable spanner1)
   added: (tightened nut6)
   goals met: 6 of 6
